In [1]:
import numpy as np
import pandas as pd

In [4]:
data = pd.DataFrame({'A':[1,np.nan,2,4,5,6],'B':[11,np.nan,21,41,np.nan,np.nan]})
data

     A     B
0  1.0  11.0
1  NaN   NaN
2  2.0  21.0
3  4.0  41.0
4  5.0   NaN
5  6.0   NaN

In [21]:
data.replace([np.nan,np.nan,np.nan],[1,12,13])

      A     B
0   1.0  11.0
1  13.0  13.0
2   2.0  21.0
3   4.0  41.0
4   5.0  13.0
5   6.0  13.0

In [11]:
data.replace(1,[1.1,12.1])
data

TypeError: Invalid "to_replace" type: 'int'

In [12]:
df = pd.DataFrame({'A': [0, 1, 2, 3, 4],
                   'B': [5, 6, 7, 8, 9],
                   'C': ['a', 'b', 'c', 'd', 'e']})
df

   A  B  C
0  0  5  a
1  1  6  b
2  2  7  c
3  3  8  d
4  4  9  e

In [18]:
df.replace(0, 5)

   A  B  C
0  5  5  a
1  1  6  b
2  2  7  c
3  3  8  d
4  4  9  e

In [19]:
df

   A  B  C
0  0  5  a
1  1  6  b
2  2  7  c
3  3  8  d
4  4  9  e

In [22]:
df.replace([0, 1, 2, 3], [4, 3, 2, 1])

   A  B  C
0  4  5  a
1  3  6  b
2  2  7  c
3  1  8  d
4  4  9  e

In [23]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
'Pastrami', 'corned beef', 'Bacon',
'pastrami', 'honey ham', 'nova lox'],
'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [31]:
lowercase = data['food'].str.lower()
lowercase

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [32]:
meat_to_animal = {
'bacon': 'chicken',
'pulled pork': 'chicken',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'chicken',
'nova lox': 'salmon'
}
# Adding animals
data["animal"] = lowercase.map(meat_to_animal)
data

          food  ounces   animal
0        bacon     4.0  chicken
1  pulled pork     3.0  chicken
2        bacon    12.0  chicken
3     Pastrami     6.0      cow
4  corned beef     7.5      cow
5        Bacon     8.0  chicken
6     pastrami     3.0      cow
7    honey ham     5.0  chicken
8     nova lox     6.0   salmon

In [33]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
index=['Ohio', 'Colorado', 'New York'],
columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [34]:
transform = lambda x:x[:4].upper()

In [37]:
# For Rows/Indexes.
data.index.map(transform)

AttributeError: 'Index' object has no attribute 'inplace'

In [39]:
# For columns.
data.columns.map(transform)

Index(['ONE', 'TWO', 'THRE', 'FOUR'], dtype='object')

In [48]:
data.rename(index={'Ohio': 'INDIANA'}, inplace=True)
data

          one  two  three  four
INDIANA     0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

# Discretization and Binning

In [52]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
len(ages)

12

In [50]:
bins = [18, 25, 35, 60, 100]

In [51]:
pd.cut(ages,bins)

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [53]:
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [54]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [57]:
# Setting right to False, here we our data when getting categorized only categorized with respect to left edge.
ages_new = [26, 20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
pd.cut(ages_new, [18, 26, 36, 61, 100], right=False)

[[26, 36), [18, 26), [18, 26), [18, 26), [26, 36), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 13
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [58]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

# Detecting and Filtering Outliers

In [59]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.020529     0.016289     0.024327     0.056657
std       0.988108     1.014052     1.017037     1.008486
min      -2.805673    -3.009320    -2.814811    -3.330963
25%      -0.664511    -0.714433    -0.683514    -0.572858
50%      -0.058707    -0.034688     0.056057     0.086293
75%       0.724262     0.679954     0.766835     0.714214
max       3.569849     2.886751     2.823259     3.250322

In [61]:
col = data[2]

In [63]:
np.abs(col[1:21])

1     0.806371
2     0.217966
3     0.055901
4     0.699575
5     1.184313
6     0.704436
7     1.006782
8     0.574976
9     1.478313
10    1.179249
11    1.177967
12    0.812147
13    0.240130
14    1.448889
15    1.188339
16    0.559452
17    1.236150
18    0.715644
19    0.077878
20    0.188532
Name: 2, dtype: float64

In [64]:
col

0      1.088260
1      0.806371
2      0.217966
3      0.055901
4     -0.699575
         ...
995   -1.377225
996    1.290939
997    0.768154
998   -1.404776
999    0.785486
Name: 2, Length: 1000, dtype: float64

In [66]:
np.sign(data.head())

     0    1    2    3
0 -1.0  1.0  1.0  1.0
1  1.0  1.0  1.0 -1.0
2  1.0 -1.0  1.0  1.0
3  1.0  1.0  1.0 -1.0
4 -1.0 -1.0 -1.0 -1.0

# Study Chapter #8 - Homework